code/openfoam/tutorials/XiFluid/moriyoshiHomogeneous/moriyoshiHomogeneous/constant/zonesGenerator
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      zonesGenerator;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type        cylinder;
    zoneType    cell;
    moveUpdate  false;

    point1  (0 0 -1);
    point2  (0 0 1);
    radius  0.0015;
}

// ************************************************************************* //
